Tekla Open API Reference for Tekla Structures 2025
EdgeChamferAttributes Properties
The EdgeChamfer.EdgeChamferAttributes type exposes the following members.
Properties
Name | Description
VisibleLines
 The line type of the chamfer.
Top
See Also
Reference
EdgeChamfer.EdgeChamferAttributes Class
Tekla.Structures.Drawing Namespace